Documents/CRM_СобытияПоРабочимЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>CRM_СобытияПоРабочимЛистам</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВидыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершеноУспешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_ЗаписьНаВыдачу</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_ЗаписьНаТестДрайв</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНаПродажуАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_СобытияПоРабочимЛистам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛидПрикрепленный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_Лид</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АвтомобилиДляВыдачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Renault_Договор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_РабочиеЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_РабочиеЛисты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>VINАвтомобилей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаID</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапросНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛистЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтересМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныЗакрытияРЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_НаборЦветов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖелаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапросаНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРабочегоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыРабочихЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязаныйIDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажаБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтомобильБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПродажиВыкупа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГарантии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАвтомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDCRM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/CRM_СтатусыТестДрайва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_СтатусыТестДрайва</Name>
			<Comment>Состояния тест-драйва</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
					<Comment>Запланировано</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
					<Comment>Выполняется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
					<Comment>Завершено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
					<Comment>Отменено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершеноДосрочно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/CRM_СтатусыДокументаЗаписьНаВыдачу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_СтатусыДокументаЗаписьНаВыдачу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/CRM_СобытияПоРабочимЛистам/Ext/ObjectModule.bsl
Перем Права Экспорт;

Перем Организация Экспорт;

Функция ПолучитьСписокПечатныхФорм(ДокументСсылка = Неопределено) Экспорт
	Возврат Новый СписокЗначений();	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Закрытие воронки продаж и статистики
	Если ВидСобытия = Справочники.CRM_ВидыСобытий.Встреча Тогда
		Если Обработано И ЗавершеноУспешно Тогда
			Renault_CRM.Воронка_ПосещениеАвтосалона_Установить(IDK, Ссылка);
			Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.ПосещениеАвтосалона, IDK, Ссылка, , ДатаЗакрытия);
		КонецЕсли;		
		Renault_CRM.Воронка_ЗапланированаВстреча_Установить(IDK, Ссылка);
		Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.НазначенаВстреча, IDK, Ссылка, , ДатаНапоминания);
	ИначеЕсли ВидСобытия = Справочники.CRM_ВидыСобытий.ТестДрайв Тогда
		//Есть права на финальные статусы тест-драйва
		Если Обработано И ЕстьПравоНаПодтверждениеТестДрайва() Тогда
			ДокТестДрайв = Объект.ПолучитьОбъект();
			Если ЗавершеноУспешно Тогда
				ДокТестДрайв.СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.Завершено;
			ИначеЕсли КомментарийЗакрытия = "Тест-драйв перенесен на другую дату" Тогда
				ДокТестДрайв.СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.Запланировано;
			Иначе
				ДокТестДрайв.СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.Отменено;
			КонецЕсли;
			ДокТестДрайв.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		//Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.ТестДрайв, IDK, Ссылка, 0, ДатаНапоминания);
	ИначеЕсли ВидСобытия = Справочники.CRM_ВидыСобытий.Выдача Тогда
		//Если Обработано Тогда
		//	ДокВыдача = Объект.ПолучитьОбъект();
		//	ДокВыдача.АвтомобилиДляВыдачи.Загрузить(АвтомобилиДляВыдачи.Выгрузить());
		//	Если ЗавершеноУспешно Тогда
		//		Если ДокВыдача.Статус <> Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Выдан Тогда
		//			ДокВыдача.Статус = Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Выдан;
		//			ДокВыдача.ДатаВыдачи = ТекущаяДата();
		//		КонецЕсли;
		//	Иначе
		//		Если ДокВыдача.Статус <> Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Отменено Тогда
		//			ДокВыдача.Статус = Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Отменено;
		//			ДокВыдача.ДатаВыдачи = ТекущаяДата();
		//		КонецЕсли;
		//	КонецЕсли;
		//	ДокВыдача.Записать(РежимЗаписиДокумента.Проведение);
		//КонецЕсли;		
	ИначеЕсли ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливости3 Тогда
		//Если Обработано Тогда
		Если Обработано И Не ЗвонокПеренесен() Тогда
			Renault_CRM.Воронка_ЗвонокВежливости3дня_УстановитьСнять(IDK);
			Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.ЗвонокВежливости3дня, IDK,, 0, ДатаНапоминания);
		КонецЕсли;
	ИначеЕсли ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливости30 Тогда
		//Если Обработано Тогда
		Если Обработано И Не ЗвонокПеренесен() Тогда
			Renault_CRM.Воронка_ЗвонокВежливости30дней_УстановитьСнять(IDK);
			Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.ЗвонокВежливости30Дней, IDK,, 0, ДатаНапоминания);
		КонецЕсли;
	ИначеЕсли ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливости360 Тогда
		//Если Обработано Тогда
		Если Обработано И Не ЗвонокПеренесен() Тогда
			Renault_CRM.Воронка_ЗвонокВежливости360дней_УстановитьСнять(IDK);
			Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.ЗвонокВежливости360Дней, IDK,, 0, ДатаНапоминания);
		КонецЕсли;                                                                
	// Беседин 19.10.21 заявка 1082
	ИначеЕсли ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливостиНовый Тогда
		//Если Обработано Тогда
		Если Обработано И Не ЗвонокПеренесен() Тогда
			Renault_CRM.Воронка_ЗвонокВежливостиНовый_УстановитьСнять(IDK);
			Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.ЗвонокВежливостиНовый, IDK,, 0, ДатаНапоминания);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЗвонкиВежливостиАвтоматически() Экспорт 
	
	ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	События = ДЦ.ЗвонкиВежливости;
		
	// Беседин 19.10.21 заявка 1082
	Для Каждого ОдноСобытие Из События Цикл        
		Если ОдноСобытие.ДелатьЗвонок Тогда
			СоздатьЗвонокВежливости(ОдноСобытие);					
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

Процедура СоздатьЗвонокВежливости(Событие) Экспорт
	//Козлов Е.А. Начало 20.07.2016
	Если Событие.ЗвонокНомер = "Звонок ДР" Тогда
		СоздатьЗвонокВежливостиДР();
		Возврат;
	КонецЕсли;	
	//Козлов Е.А. Конец
	
	СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
	СобытиеОбъект.Дата = ТекущаяДата();
	СобытиеОбъект.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
	СобытиеОбъект.ДатаНапоминания = СобытиеОбъект.Дата  + Событие.КоличествоДней*60*60*24;
	СобытиеОбъект.IDK = IDK;
	СобытиеОбъект.ДилерскийЦентр = ДилерскийЦентр;
	СобытиеОбъект.Подразделение = Подразделение;
	СобытиеОбъект.Отдел = Отдел;
	Если СокрЛП(Событие.ЗвонокНомер) = "Звонок №1" Тогда
		СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливости3;
		СобытиеОбъект.Комментарий = "Звонок вежливости "+Событие.КоличествоДней+" д.";
	ИначеЕсли СокрЛП(Событие.ЗвонокНомер) = "Звонок №2" Тогда
		СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливости30; 
		СобытиеОбъект.Комментарий = "Звонок вежливости "+Событие.КоличествоДней+" д.";
	ИначеЕсли СокрЛП(Событие.ЗвонокНомер) = "Звонок №3" Тогда
		СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливости360;   
		СобытиеОбъект.Комментарий = "Звонок вежливости "+Событие.КоличествоДней+" д.";		
	// Беседин 19.10.21 заявка 1082
	ИначеЕсли НЕ СокрЛП(Событие.ЗвонокНомер) = "Звонок ДР" Тогда
		СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливостиНовый;
		СобытиеОбъект.Комментарий = "Звонок вежливости "+СокрЛП(Событие.ЗвонокНомер) + " "+Событие.КоличествоДней + " д.";
	КонецЕсли;
	СобытиеОбъект.Сотрудник = Сотрудник;
	СобытиеОбъект.Обработано = Ложь;
	СобытиеОбъект.ЗавершеноУспешно = Ложь;
	
	//СобытиеОбъект.Отдел = Отдел;
	//СобытиеОбъект.Подразделение = Подразделение;	
	Попытка
		СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

//Козлов Е.А. Начало 20.07.2016
Процедура СоздатьЗвонокВежливостиДР()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_РабочиеЛисты.Клиент.ДатаРождения КАК ДатаРождения,
		|	Renault_РабочиеЛисты.Отдел КАК Отдел,
		|	Renault_РабочиеЛисты.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
		|ГДЕ
		|	Renault_РабочиеЛисты.IDK = &IDK";	
	Запрос.УстановитьПараметр("IDK", IDK);	
	Результат = Запрос.Выполнить(); 	
	Выборка = Результат.Выбрать(); 	
	Выборка.Следующий(); 
	
	КлиентДатаРождения = Выборка.ДатаРождения;
	
	Если ЗначениеЗаполнено(КлиентДатаРождения) Тогда
		ДатаЗвонкаДР = Документы.CRM_СобытияПоРабочимЛистам.ПолучитьБлижайшуюДатуДР(КлиентДатаРождения); 		
				
		Если ЗначениеЗаполнено(ДатаЗвонкаДр) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	CRM_СобытияПоРабочимЛистам.Ссылка
			               |ИЗ
			               |	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
			               |ГДЕ
			               |	CRM_СобытияПоРабочимЛистам.IDK = &РабочийЛист
			               |	И CRM_СобытияПоРабочимЛистам.ВидСобытия = ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.ЗвонокВежливостиДР)
			               |	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
			               |	И CRM_СобытияПоРабочимЛистам.ДатаНапоминания = &ДатаНапоминания
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
			Запрос.УстановитьПараметр("РабочийЛист", IDK);
			Запрос.УстановитьПараметр("ДатаНапоминания", ДатаЗвонкаДР);
			Результат = Запрос.Выполнить();
				
			Если Результат.Пустой() Тогда 				
					СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
					СобытиеОбъект.IDK = IDK;
					СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливостиДР;
					СобытиеОбъект.Сотрудник = Сотрудник;
					СобытиеОбъект.Отдел = Выборка.Отдел;
					СобытиеОбъект.ДилерскийЦентр = ДилерскийЦентр;
					СобытиеОбъект.Подразделение =  Выборка.Подразделение;
					СобытиеОбъект.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
					СобытиеОбъект.Дата = ТекущаяДата();
					СобытиеОбъект.ДатаНапоминания = ДатаЗвонкаДР;
					СобытиеОбъект.Комментарий = "Звонок на день рождения";
					СобытиеОбъект.Обработано = Ложь;
					СобытиеОбъект.ЗавершеноУспешно = Ложь;
					СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);					
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
//Козлов Е.А. Конец

Функция ЕстьПравоНаПодтверждениеТестДрайва()
	
	Возврат Renault_РаботаСПравамиПользователя.ЕстьПравоНаПодтверждениеДокументаТестДрайв(ПараметрыСеанса.Пользователь);
	//обПраво(ПланыВидовХарактеристик.ПраваИНастройки.ПравоНаПодтверждениеДокументаТестДрайв);
	
КонецФункции

Функция ПолучитьТестДрайвыНаДату(вхПериод,Авто) Экспорт
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	CRM_ЗаписьНаТестДрайв.Ссылка,
	                   |	CRM_ЗаписьНаТестДрайв.Менеджер,
	                   |	CRM_ЗаписьНаТестДрайв.Клиент,
	                   |	ЧАС(CRM_ЗаписьНаТестДрайв.Начало) КАК Час,
	                   |	МИНУТА(CRM_ЗаписьНаТестДрайв.Начало) КАК Минута,
	                   |	CRM_ЗаписьНаТестДрайв.Продолжительность,
	                   |	CRM_ЗаписьНаТестДрайв.СтатусДокумента,
	                   |	ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.ТестДрайв) КАК ВидСобытия,
	                   |	CRM_ЗаписьНаТестДрайв.РабочийЛист
	                   |ИЗ
	                   |	Документ.CRM_ЗаписьНаТестДрайв КАК CRM_ЗаписьНаТестДрайв
	                   |ГДЕ
	                   |	CRM_ЗаписьНаТестДрайв.ДатаПроведения МЕЖДУ &ДатаПроведенияНачало И &ДатаПроведенияОкончание
	                   |	И CRM_ЗаписьНаТестДрайв.Автомобиль = &Автомобиль
	                   |	И CRM_ЗаписьНаТестДрайв.СтатусДокумента В(&СтатусыДокумента)
	                   |	И CRM_ЗаписьНаТестДрайв.ПометкаУдаления = ЛОЖЬ");	
	Зап.УстановитьПараметр("ДатаПроведенияНачало",НачалоДня(вхПериод));
	Зап.УстановитьПараметр("ДатаПроведенияОкончание",КонецДня(вхПериод));
    МассивСтатусов = новый Массив();
	МассивСтатусов.Добавить(Перечисления.CRM_СтатусыТестДрайва.Выполняется);
	МассивСтатусов.Добавить(Перечисления.CRM_СтатусыТестДрайва.Запланировано);
	МассивСтатусов.Добавить(Перечисления.CRM_СтатусыТестДрайва.Завершено);
	МассивСтатусов.Добавить(Перечисления.CRM_СтатусыТестДрайва.ЗавершеноДосрочно);
	Зап.УстановитьПараметр("Автомобиль",Авто);
    Зап.УстановитьПараметр("СтатусыДокумента",МассивСтатусов);
	Выг = зап.Выполнить().Выгрузить();
	Возврат Выг;
КонецФункции

Функция ПолучитьТестДрайвыИДругиеСобытияНаДату(вхПериод,Менеджер,Авто,ШагМинут = 5) Экспорт
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	CRM_ЗаписьНаТестДрайв.Ссылка,
	                   |	CRM_ЗаписьНаТестДрайв.Менеджер,
	                   |	CRM_ЗаписьНаТестДрайв.Клиент,
	                   |	ЧАС(CRM_ЗаписьНаТестДрайв.Начало) КАК Час,
	                   |	МИНУТА(CRM_ЗаписьНаТестДрайв.Начало) КАК Минута,
	                   |	CRM_ЗаписьНаТестДрайв.Продолжительность,
	                   |	CRM_ЗаписьНаТестДрайв.СтатусДокумента,
	                   |	ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.ТестДрайв) КАК ВидСобытия,
	                   |	CRM_ЗаписьНаТестДрайв.РабочийЛист
	                   |ИЗ
	                   |	Документ.CRM_ЗаписьНаТестДрайв КАК CRM_ЗаписьНаТестДрайв
	                   |ГДЕ
	                   |	CRM_ЗаписьНаТестДрайв.ДатаПроведения МЕЖДУ &ДатаПроведенияНачало И &ДатаПроведенияОкончание
	                   |	И CRM_ЗаписьНаТестДрайв.Автомобиль = &Автомобиль
	                   |	И CRM_ЗаписьНаТестДрайв.СтатусДокумента В(&СтатусыДокумента)
	                   |	И CRM_ЗаписьНаТестДрайв.ПометкаУдаления = ЛОЖЬ
	                   |
	                   |ОБЪЕДИНИТЬ ВСЕ
	                   |
	                   |ВЫБРАТЬ
	                   |	CRM_ЗаписьНаВыдачу.Ссылка,
	                   |	CRM_ЗаписьНаВыдачу.Менеджер,
	                   |	CRM_ЗаписьНаВыдачу.Клиент,
	                   |	ЧАС(CRM_ЗаписьНаВыдачу.ДатаНачала),
	                   |	МИНУТА(CRM_ЗаписьНаВыдачу.ДатаНачала),
	                   |	CRM_ЗаписьНаВыдачу.Продолжительность,
	                   |	CRM_ЗаписьНаВыдачу.Статус,
	                   |	ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.Выдача),
	                   |	CRM_ЗаписьНаВыдачу.IDK
	                   |ИЗ
	                   |	Документ.CRM_ЗаписьНаВыдачу КАК CRM_ЗаписьНаВыдачу
	                   |ГДЕ
	                   |	CRM_ЗаписьНаВыдачу.ДатаНачала МЕЖДУ &ДатаПроведенияНачало И &ДатаПроведенияОкончание
	                   |	И CRM_ЗаписьНаВыдачу.Статус В(&Статус)
	                   |	И CRM_ЗаписьНаВыдачу.ПометкаУдаления = ЛОЖЬ
	                   |	И CRM_ЗаписьНаВыдачу.Менеджер = &Менеджер
	                   |
	                   |ОБЪЕДИНИТЬ ВСЕ
	                   |
	                   |ВЫБРАТЬ
	                   |	CRM_СобытияПоРабочимЛистам.Ссылка,
	                   |	CRM_СобытияПоРабочимЛистам.Сотрудник,
	                   |	Renault_РабочиеЛисты.Клиент,
	                   |	ЧАС(CRM_СобытияПоРабочимЛистам.ДатаНапоминания),
	                   |	МИНУТА(CRM_СобытияПоРабочимЛистам.ДатаНапоминания),
	                   |	&ШагМинут,
	                   |	""Прочее"",
	                   |	CRM_СобытияПоРабочимЛистам.ВидСобытия,
	                   |	CRM_СобытияПоРабочимЛистам.IDK
	                   |ИЗ
	                   |	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
	                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	                   |		ПО CRM_СобытияПоРабочимЛистам.IDK = Renault_РабочиеЛисты.IDK
	                   |ГДЕ
	                   |	CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
	                   |	И НЕ CRM_СобытияПоРабочимЛистам.ВидСобытия В (&ВидСобытий)
	                   |	И CRM_СобытияПоРабочимЛистам.ДатаНапоминания МЕЖДУ &ДатаПроведенияНачало И &ДатаПроведенияОкончание
	                   |	И CRM_СобытияПоРабочимЛистам.Сотрудник = &Менеджер
	                   |
	                   |ОБЪЕДИНИТЬ ВСЕ
	                   |
	                   |ВЫБРАТЬ
	                   |	CRM_ЗаписьНаТестДрайв.Ссылка,
	                   |	CRM_ЗаписьНаТестДрайв.Менеджер,
	                   |	CRM_ЗаписьНаТестДрайв.Клиент,
	                   |	ЧАС(CRM_ЗаписьНаТестДрайв.Начало),
	                   |	МИНУТА(CRM_ЗаписьНаТестДрайв.Начало),
	                   |	CRM_ЗаписьНаТестДрайв.Продолжительность,
	                   |	CRM_ЗаписьНаТестДрайв.СтатусДокумента,
	                   |	""Тест-драйв"",
	                   |	CRM_ЗаписьНаТестДрайв.РабочийЛист
	                   |ИЗ
	                   |	Документ.CRM_ЗаписьНаТестДрайв КАК CRM_ЗаписьНаТестДрайв
	                   |ГДЕ
	                   |	CRM_ЗаписьНаТестДрайв.ДатаПроведения МЕЖДУ &ДатаПроведенияНачало И &ДатаПроведенияОкончание
	                   |	И CRM_ЗаписьНаТестДрайв.Автомобиль <> &Автомобиль
	                   |	И CRM_ЗаписьНаТестДрайв.СтатусДокумента В(&СтатусыДокумента)
	                   |	И CRM_ЗаписьНаТестДрайв.ПометкаУдаления = ЛОЖЬ
	                   |	И CRM_ЗаписьНаТестДрайв.Менеджер = &Менеджер");	
	Зап.УстановитьПараметр("ДатаПроведенияНачало",НачалоДня(вхПериод));
	Зап.УстановитьПараметр("ДатаПроведенияОкончание",КонецДня(вхПериод));
	Зап.УстановитьПараметр("Менеджер",Менеджер);
    МассивСтатусов = новый Массив();
	МассивСтатусов.Добавить(Перечисления.CRM_СтатусыТестДрайва.Выполняется);
	МассивСтатусов.Добавить(Перечисления.CRM_СтатусыТестДрайва.Запланировано);
	МассивСтатусов.Добавить(Перечисления.CRM_СтатусыТестДрайва.Завершено);
	МассивСтатусов.Добавить(Перечисления.CRM_СтатусыТестДрайва.ЗавершеноДосрочно);
	МассивСтатусовВыдач = новый Массив();
	МассивСтатусовВыдач.Добавить(Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Черновик);
	МассивСобытий = новый Массив();
	МассивСобытий.Добавить(Справочники.CRM_ВидыСобытий.Выдача);
	МассивСобытий.Добавить(Справочники.CRM_ВидыСобытий.ТестДрайв);
	Зап.УстановитьПараметр("Автомобиль",Авто);
    Зап.УстановитьПараметр("СтатусыДокумента",МассивСтатусов);
	Зап.УстановитьПараметр("Статус",МассивСтатусовВыдач);
	Зап.УстановитьПараметр("ВидСобытий",МассивСобытий);
	Зап.УстановитьПараметр("ШагМинут",ШагМинут);
	Выг = зап.Выполнить().Выгрузить();
	Возврат Выг;
КонецФункции

Функция ПолучитьВыдачиИДругиеСобытияНаДату(вхПериод,Менеджер,ШагМинут = 5,Выдача = неопределено) Экспорт
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	CRM_ЗаписьНаТестДрайв.Ссылка,
	                   |	CRM_ЗаписьНаТестДрайв.Менеджер,
	                   |	CRM_ЗаписьНаТестДрайв.Клиент,
	                   |	ЧАС(CRM_ЗаписьНаТестДрайв.Начало) КАК Час,
	                   |	МИНУТА(CRM_ЗаписьНаТестДрайв.Начало) КАК Минута,
	                   |	CRM_ЗаписьНаТестДрайв.Продолжительность,
	                   |	CRM_ЗаписьНаТестДрайв.СтатусДокумента,
	                   |	ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.ТестДрайв) КАК ВидСобытия,
	                   |	CRM_ЗаписьНаТестДрайв.РабочийЛист
	                   |ИЗ
	                   |	Документ.CRM_ЗаписьНаТестДрайв КАК CRM_ЗаписьНаТестДрайв
	                   |ГДЕ
	                   |	CRM_ЗаписьНаТестДрайв.ДатаПроведения МЕЖДУ &ДатаПроведенияНачало И &ДатаПроведенияОкончание
	                   |	И CRM_ЗаписьНаТестДрайв.СтатусДокумента В(&СтатусыДокумента)
	                   |	И CRM_ЗаписьНаТестДрайв.ПометкаУдаления = ЛОЖЬ
	                   |	И CRM_ЗаписьНаТестДрайв.Менеджер = &Менеджер
	                   |
	                   |ОБЪЕДИНИТЬ ВСЕ
	                   |
	                   |ВЫБРАТЬ
	                   |	CRM_ЗаписьНаВыдачу.Ссылка,
	                   |	CRM_ЗаписьНаВыдачу.Менеджер,
	                   |	CRM_ЗаписьНаВыдачу.Клиент,
	                   |	ЧАС(CRM_ЗаписьНаВыдачу.ДатаНачала),
	                   |	МИНУТА(CRM_ЗаписьНаВыдачу.ДатаНачала),
	                   |	ЕСТЬNULL(CRM_ЗаписьНаВыдачу.Продолжительность, &Шагминут),
	                   |	CRM_ЗаписьНаВыдачу.Статус,
	                   |	ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.Выдача),
	                   |	CRM_ЗаписьНаВыдачу.IDK
	                   |ИЗ
	                   |	Документ.CRM_ЗаписьНаВыдачу КАК CRM_ЗаписьНаВыдачу
	                   |ГДЕ
	                   |	CRM_ЗаписьНаВыдачу.ДатаНачала МЕЖДУ &ДатаПроведенияНачало И &ДатаПроведенияОкончание
	                   |	И CRM_ЗаписьНаВыдачу.Статус В(&Статус)
	                   |	И CRM_ЗаписьНаВыдачу.ПометкаУдаления = ЛОЖЬ
	                   |	И CRM_ЗаписьНаВыдачу.ЗонаВыдачи = &Выдача
	                   |
	                   |ОБЪЕДИНИТЬ ВСЕ
	                   |
	                   |ВЫБРАТЬ
	                   |	CRM_СобытияПоРабочимЛистам.Ссылка,
	                   |	CRM_СобытияПоРабочимЛистам.Сотрудник,
	                   |	Renault_РабочиеЛисты.Клиент,
	                   |	ЧАС(CRM_СобытияПоРабочимЛистам.ДатаНапоминания),
	                   |	МИНУТА(CRM_СобытияПоРабочимЛистам.ДатаНапоминания),
	                   |	&ШагМинут,
	                   |	""Прочее"",
	                   |	CRM_СобытияПоРабочимЛистам.ВидСобытия,
	                   |	CRM_СобытияПоРабочимЛистам.IDK
	                   |ИЗ
	                   |	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
	                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	                   |		ПО CRM_СобытияПоРабочимЛистам.IDK = Renault_РабочиеЛисты.IDK
	                   |ГДЕ
	                   |	CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
	                   |	И НЕ CRM_СобытияПоРабочимЛистам.ВидСобытия В (&ВидСобытий)
	                   |	И CRM_СобытияПоРабочимЛистам.ДатаНапоминания МЕЖДУ &ДатаПроведенияНачало И &ДатаПроведенияОкончание
	                   |	И CRM_СобытияПоРабочимЛистам.Сотрудник = &Менеджер
	                   |
	                   |ОБЪЕДИНИТЬ ВСЕ
	                   |
	                   |ВЫБРАТЬ
	                   |	CRM_ЗаписьНаВыдачу.Ссылка,
	                   |	CRM_ЗаписьНаВыдачу.Менеджер,
	                   |	CRM_ЗаписьНаВыдачу.Клиент,
	                   |	ЧАС(CRM_ЗаписьНаВыдачу.ДатаНачала),
	                   |	МИНУТА(CRM_ЗаписьНаВыдачу.ДатаНачала),
	                   |	ЕСТЬNULL(CRM_ЗаписьНаВыдачу.Продолжительность, &Шагминут),
	                   |	CRM_ЗаписьНаВыдачу.Статус,
	                   |	""Выдача"",
	                   |	CRM_ЗаписьНаВыдачу.IDK
	                   |ИЗ
	                   |	Документ.CRM_ЗаписьНаВыдачу КАК CRM_ЗаписьНаВыдачу
	                   |ГДЕ
	                   |	CRM_ЗаписьНаВыдачу.ДатаНачала МЕЖДУ &ДатаПроведенияНачало И &ДатаПроведенияОкончание
	                   |	И CRM_ЗаписьНаВыдачу.Статус В(&Статус)
	                   |	И CRM_ЗаписьНаВыдачу.ПометкаУдаления = ЛОЖЬ
	                   |	И CRM_ЗаписьНаВыдачу.ЗонаВыдачи <> &Выдача
	                   |	И CRM_ЗаписьНаВыдачу.Менеджер = &Менеджер");	
	Зап.УстановитьПараметр("ДатаПроведенияНачало",НачалоДня(вхПериод));
	Зап.УстановитьПараметр("ДатаПроведенияОкончание",КонецДня(вхПериод));
	Зап.УстановитьПараметр("Выдача",Выдача);
	Зап.УстановитьПараметр("Менеджер",Менеджер);
    МассивСтатусов = новый Массив();
	МассивСтатусов.Добавить(Перечисления.CRM_СтатусыТестДрайва.Выполняется);
	МассивСтатусов.Добавить(Перечисления.CRM_СтатусыТестДрайва.Запланировано);
	МассивСтатусовВыдач = новый Массив();
	МассивСтатусовВыдач.Добавить(Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Черновик);
	МассивСтатусовВыдач.Добавить(Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Выдан);
	МассивСобытий = новый Массив();
	МассивСобытий.Добавить(Справочники.CRM_ВидыСобытий.Выдача);
	МассивСобытий.Добавить(Справочники.CRM_ВидыСобытий.ТестДрайв);
	Зап.УстановитьПараметр("СтатусыДокумента",МассивСтатусов);
	Зап.УстановитьПараметр("Статус",МассивСтатусовВыдач);
	Зап.УстановитьПараметр("ВидСобытий",МассивСобытий);
	Зап.УстановитьПараметр("ШагМинут",ШагМинут);
	Выг = зап.Выполнить().Выгрузить();
	Возврат Выг;
КонецФункции

Функция ПолучитьВыдачиНаДату(вхПериод,Выдача) Экспорт
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	CRM_ЗаписьНаВыдачу.Ссылка,
	                   |	CRM_ЗаписьНаВыдачу.Менеджер,
	                   |	CRM_ЗаписьНаВыдачу.Клиент,
	                   |	ЧАС(CRM_ЗаписьНаВыдачу.ДатаНачала) КАК Час,
	                   |	МИНУТА(CRM_ЗаписьНаВыдачу.ДатаНачала) КАК Минута,
	                   |	ЕСТЬNULL(CRM_ЗаписьНаВыдачу.Продолжительность, 5) КАК Продолжительность,
	                   |	CRM_ЗаписьНаВыдачу.Статус КАК СтатусДокумента,
	                   |	ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.Выдача) КАК ВидСобытия,
	                   |	CRM_ЗаписьНаВыдачу.IDK КАК РабочийЛист,
	                   |	CRM_ЗаписьНаВыдачу.ЗонаВыдачи
	                   |ИЗ
	                   |	Документ.CRM_ЗаписьНаВыдачу КАК CRM_ЗаписьНаВыдачу
	                   |ГДЕ
	                   |	CRM_ЗаписьНаВыдачу.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	                   |	И НЕ CRM_ЗаписьНаВыдачу.Статус В (&Статус)
	                   |	И CRM_ЗаписьНаВыдачу.ПометкаУдаления = ЛОЖЬ
	                   |	И CRM_ЗаписьНаВыдачу.ЗонаВыдачи.Ссылка = &Выдача");	
	Зап.УстановитьПараметр("ДатаНачала",НачалоДня(вхПериод));
	Зап.УстановитьПараметр("ДатаОкончания",КонецДня(вхПериод));
	Зап.УстановитьПараметр("Выдача",Выдача);
    МассивСтатусов = новый Массив();
	МассивСтатусов.Добавить(Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Отменено);
	//МассивСтатусов.Добавить(Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Выдан);
	//МассивСтатусов.Добавить(Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.);
	Зап.УстановитьПараметр("Статус",МассивСтатусов);
	Выг = зап.Выполнить().Выгрузить();
	Возврат Выг;
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ВидСобытия = Справочники.CRM_ВидыСобытий.Встреча Тогда		
		Renault_CRM.Статистика_Снять(Справочники.CRM_ЭтапыПродаж.ПосещениеАвтосалона, IDK);
		Renault_CRM.Статистика_Снять(Справочники.CRM_ЭтапыПродаж.НазначенаВстреча, IDK);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

//v+
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

    Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;

    //права на события
    ВидРазрешения = ?(ЭтоНовый(), "создание", "редактирование");
    МассивРазрешенных = Справочники.CRM_ВидыСобытий.РазрешенныеСобытия(ВидРазрешения);
    Если МассивРазрешенных.Найти(ВидСобытия) = Неопределено Тогда // Нет прав у пользователя
        Сообщить("Нет прав на """ + ВидРазрешения + """ события """ + ВидСобытия + """.", СтатусСообщения.Внимание);
        Отказ = Истина;
        Возврат;
    КонецЕсли;

	Если ЗначениеЗаполнено(ДатаЗакрытия) Тогда
		Если ЗначениеЗаполнено(ВидСобытия.ДлительностьПоУмолчанию) Тогда
			Длительность = ВидСобытия.ДлительностьПоУмолчанию;
        Иначе
			Длительность = (ДатаЗакрытия - ДатаНапоминания) / 60;
		КонецЕсли;
    КонецЕсли;

КонецПроцедуры
//v-      

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Функция ЗвонокПеренесен()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.Основание = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции
